#我刷朋友的逻辑和过滤
def 查看历史朋友圈（）
    进入此人朋友圈
    翻看历史朋友圈
return

if 看到广告微商:
    if 是否认识或者朋友：
        查看历史朋友圈
        if 历史记录多是广告微商
            屏蔽设置不看此人朋友圈
            返回
    else:
        直接删除该好友

else if:看不懂的无趣内容
    if 是否认识或者朋友:
        查看历史朋友圈
        if 历史记录多是看不懂的无趣内容:
            屏蔽设置不看此人朋友圈
            返回
    else:
        直接删除该好友
else if:低质量的九宫格图片
    if 是否认识或者朋友:
        查看历史朋友圈
        if 多是低质量的自拍九宫格图:
            屏蔽设置不看此人朋友圈
            返回
        else:
    直接删除该好友  

else if:有气质的精美图片
    查看历史朋友圈
    主动聊天多关注

else if:高质量的文章转发和内容
    点开文章
    if 内容是否标题党:
        退出
        查看历史朋友圈
    else:
        收藏文章链接有空详读

    

   